of/org/cavity/system/blockMeshDict_cavity_comsol
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|   \\  /    O peration     | Web:      https://www.OpenFOAM.org              |
|  \\    /   A nd           | Version:  8                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
(0.012500 0.000000 0)
(0.000000 0.000000 0)
(0.002521 0.002521 0)
(0.014194 0.002569 0)
(0.025000 0.000000 0)
(0.000000 0.012500 0)
(0.037500 0.000000 0)
(0.005547 0.005547 0)
(0.002600 0.014267 0)
(0.016227 0.005651 0)
(0.026070 0.002666 0)
(0.002670 0.026149 0)
(0.000000 0.025000 0)
(0.050000 0.000000 0)
(0.038007 0.002759 0)
(0.062500 0.000000 0)
(0.075000 0.000000 0)
(0.011901 0.011771 0)
(0.005719 0.016388 0)
(0.017324 0.011578 0)
(0.027353 0.005866 0)
(0.005875 0.027527 0)
(0.002685 0.038079 0)
(0.002632 0.050043 0)
(0.000000 0.037500 0)
(0.097532 0.002468 0)
(0.087500 0.000000 0)
(0.049955 0.002772 0)
(0.038615 0.006070 0)
(0.085803 0.002496 0)
(0.094571 0.005429 0)
(0.061919 0.002693 0)
(0.073884 0.002594 0)
(0.014686 0.019693 0)
(0.027714 0.013635 0)
(0.094462 0.016152 0)
(0.011466 0.029406 0)
(0.005906 0.038775 0)
(0.005790 0.050095 0)
(0.002579 0.062026 0)
(0.000000 0.050000 0)
(0.097483 0.014160 0)
(0.100000 0.000000 0)
(0.049900 0.006098 0)
(0.041364 0.011510 0)
(0.083768 0.005490 0)
(0.088439 0.011403 0)
(0.061221 0.005925 0)
(0.072545 0.005708 0)
(0.023585 0.028550 0)
(0.039667 0.019281 0)
(0.089107 0.018071 0)
(0.094213 0.027321 0)
(0.011998 0.041724 0)
(0.005675 0.061458 0)
(0.010453 0.057063 0)
(0.005711 0.072709 0)
(0.005747 0.083710 0)
(0.002596 0.073959 0)
(0.000000 0.062500 0)
(0.097369 0.026055 0)
(0.100000 0.012500 0)
(0.025389 0.042692 0)
(0.055260 0.014500 0)
(0.079982 0.014711 0)
(0.069405 0.011516 0)
(0.038117 0.035340 0)
(0.051955 0.026954 0)
(0.085654 0.025818 0)
(0.093837 0.038632 0)
(0.020782 0.058104 0)
(0.013776 0.070448 0)
(0.010599 0.081272 0)
(0.011596 0.087625 0)
(0.006126 0.093874 0)
(0.002612 0.085777 0)
(0.000000 0.075000 0)
(0.097199 0.038014 0)
(0.100000 0.025000 0)
(0.036595 0.050954 0)
(0.070954 0.024971 0)
(0.055471 0.042753 0)
(0.089005 0.040671 0)
(0.082734 0.039336 0)
(0.093483 0.049893 0)
(0.033991 0.063732 0)
(0.026129 0.073226 0)
(0.018671 0.085651 0)
(0.016837 0.093620 0)
(0.002785 0.097215 0)
(0.000000 0.087500 0)
(0.097038 0.049951 0)
(0.100000 0.037500 0)
(0.047445 0.061640 0)
(0.074699 0.044430 0)
(0.062630 0.056371 0)
(0.086474 0.053700 0)
(0.093520 0.061101 0)
(0.039002 0.074734 0)
(0.032179 0.085229 0)
(0.027738 0.093636 0)
(0.014472 0.097100 0)
(0.000000 0.100000 0)
(0.097055 0.061864 0)
(0.100000 0.050000 0)
(0.060115 0.066690 0)
(0.051306 0.073396 0)
(0.074159 0.063416 0)
(0.093798 0.072332 0)
(0.087022 0.066354 0)
(0.046175 0.086065 0)
(0.038825 0.093859 0)
(0.026244 0.097107 0)
(0.012500 0.100000 0)
(0.094108 0.083495 0)
(0.097181 0.073787 0)
(0.100000 0.062500 0)
(0.064708 0.078552 0)
(0.082831 0.079137 0)
(0.059091 0.089042 0)
(0.050094 0.094257 0)
(0.038102 0.097209 0)
(0.025000 0.100000 0)
(0.087535 0.088267 0)
(0.094328 0.094328 0)
(0.097322 0.085679 0)
(0.100000 0.075000 0)
(0.071461 0.088218 0)
(0.079719 0.088969 0)
(0.061507 0.094593 0)
(0.050043 0.097390 0)
(0.037500 0.100000 0)
(0.083905 0.094548 0)
(0.097422 0.097422 0)
(0.100000 0.087500 0)
(0.072865 0.094677 0)
(0.062049 0.097542 0)
(0.050000 0.100000 0)
(0.085866 0.097522 0)
(0.100000 0.100000 0)
(0.074029 0.097581 0)
(0.062500 0.100000 0)
(0.087500 0.100000 0)
(0.075000 0.100000 0)
(0.012500 0.000000 1)
(0.000000 0.000000 1)
(0.002521 0.002521 1)
(0.014194 0.002569 1)
(0.025000 0.000000 1)
(0.000000 0.012500 1)
(0.037500 0.000000 1)
(0.005547 0.005547 1)
(0.002600 0.014267 1)
(0.016227 0.005651 1)
(0.026070 0.002666 1)
(0.002670 0.026149 1)
(0.000000 0.025000 1)
(0.050000 0.000000 1)
(0.038007 0.002759 1)
(0.062500 0.000000 1)
(0.075000 0.000000 1)
(0.011901 0.011771 1)
(0.005719 0.016388 1)
(0.017324 0.011578 1)
(0.027353 0.005866 1)
(0.005875 0.027527 1)
(0.002685 0.038079 1)
(0.002632 0.050043 1)
(0.000000 0.037500 1)
(0.097532 0.002468 1)
(0.087500 0.000000 1)
(0.049955 0.002772 1)
(0.038615 0.006070 1)
(0.085803 0.002496 1)
(0.094571 0.005429 1)
(0.061919 0.002693 1)
(0.073884 0.002594 1)
(0.014686 0.019693 1)
(0.027714 0.013635 1)
(0.094462 0.016152 1)
(0.011466 0.029406 1)
(0.005906 0.038775 1)
(0.005790 0.050095 1)
(0.002579 0.062026 1)
(0.000000 0.050000 1)
(0.097483 0.014160 1)
(0.100000 0.000000 1)
(0.049900 0.006098 1)
(0.041364 0.011510 1)
(0.083768 0.005490 1)
(0.088439 0.011403 1)
(0.061221 0.005925 1)
(0.072545 0.005708 1)
(0.023585 0.028550 1)
(0.039667 0.019281 1)
(0.089107 0.018071 1)
(0.094213 0.027321 1)
(0.011998 0.041724 1)
(0.005675 0.061458 1)
(0.010453 0.057063 1)
(0.005711 0.072709 1)
(0.005747 0.083710 1)
(0.002596 0.073959 1)
(0.000000 0.062500 1)
(0.097369 0.026055 1)
(0.100000 0.012500 1)
(0.025389 0.042692 1)
(0.055260 0.014500 1)
(0.079982 0.014711 1)
(0.069405 0.011516 1)
(0.038117 0.035340 1)
(0.051955 0.026954 1)
(0.085654 0.025818 1)
(0.093837 0.038632 1)
(0.020782 0.058104 1)
(0.013776 0.070448 1)
(0.010599 0.081272 1)
(0.011596 0.087625 1)
(0.006126 0.093874 1)
(0.002612 0.085777 1)
(0.000000 0.075000 1)
(0.097199 0.038014 1)
(0.100000 0.025000 1)
(0.036595 0.050954 1)
(0.070954 0.024971 1)
(0.055471 0.042753 1)
(0.089005 0.040671 1)
(0.082734 0.039336 1)
(0.093483 0.049893 1)
(0.033991 0.063732 1)
(0.026129 0.073226 1)
(0.018671 0.085651 1)
(0.016837 0.093620 1)
(0.002785 0.097215 1)
(0.000000 0.087500 1)
(0.097038 0.049951 1)
(0.100000 0.037500 1)
(0.047445 0.061640 1)
(0.074699 0.044430 1)
(0.062630 0.056371 1)
(0.086474 0.053700 1)
(0.093520 0.061101 1)
(0.039002 0.074734 1)
(0.032179 0.085229 1)
(0.027738 0.093636 1)
(0.014472 0.097100 1)
(0.000000 0.100000 1)
(0.097055 0.061864 1)
(0.100000 0.050000 1)
(0.060115 0.066690 1)
(0.051306 0.073396 1)
(0.074159 0.063416 1)
(0.093798 0.072332 1)
(0.087022 0.066354 1)
(0.046175 0.086065 1)
(0.038825 0.093859 1)
(0.026244 0.097107 1)
(0.012500 0.100000 1)
(0.094108 0.083495 1)
(0.097181 0.073787 1)
(0.100000 0.062500 1)
(0.064708 0.078552 1)
(0.082831 0.079137 1)
(0.059091 0.089042 1)
(0.050094 0.094257 1)
(0.038102 0.097209 1)
(0.025000 0.100000 1)
(0.087535 0.088267 1)
(0.094328 0.094328 1)
(0.097322 0.085679 1)
(0.100000 0.075000 1)
(0.071461 0.088218 1)
(0.079719 0.088969 1)
(0.061507 0.094593 1)
(0.050043 0.097390 1)
(0.037500 0.100000 1)
(0.083905 0.094548 1)
(0.097422 0.097422 1)
(0.100000 0.087500 1)
(0.072865 0.094677 1)
(0.062049 0.097542 1)
(0.050000 0.100000 1)
(0.085866 0.097522 1)
(0.100000 0.100000 1)
(0.074029 0.097581 1)
(0.062500 0.100000 1)
(0.087500 0.100000 1)
(0.075000 0.100000 1)
);

blocks
(
    hex (2 146 145 1 3 147 144 0) (1 1 1) simpleGrading (1 1 1)
    hex (2 146 152 8 1 145 149 5) (1 1 1) simpleGrading (1 1 1)
    hex (7 151 146 2 9 153 147 3) (1 1 1) simpleGrading (1 1 1)
    hex (3 147 144 0 10 154 148 4) (1 1 1) simpleGrading (1 1 1)
    hex (8 152 155 11 5 149 156 12) (1 1 1) simpleGrading (1 1 1)
    hex (10 154 148 4 14 158 150 6) (1 1 1) simpleGrading (1 1 1)
    hex (7 151 162 18 2 146 152 8) (1 1 1) simpleGrading (1 1 1)
    hex (9 153 147 3 20 164 154 10) (1 1 1) simpleGrading (1 1 1)
    hex (18 162 165 21 8 152 155 11) (1 1 1) simpleGrading (1 1 1)
    hex (11 155 166 22 12 156 168 24) (1 1 1) simpleGrading (1 1 1)
    hex (14 158 150 6 27 171 157 13) (1 1 1) simpleGrading (1 1 1)
    hex (20 164 154 10 28 172 158 14) (1 1 1) simpleGrading (1 1 1)
    hex (31 175 171 27 15 159 157 13) (1 1 1) simpleGrading (1 1 1)
    hex (29 173 176 32 26 170 160 16) (1 1 1) simpleGrading (1 1 1)
    hex (32 176 175 31 16 160 159 15) (1 1 1) simpleGrading (1 1 1)
    hex (21 165 181 37 11 155 166 22) (1 1 1) simpleGrading (1 1 1)
    hex (37 181 182 38 22 166 167 23) (1 1 1) simpleGrading (1 1 1)
    hex (22 166 167 23 24 168 184 40) (1 1 1) simpleGrading (1 1 1)
    hex (30 174 169 25 35 179 185 41) (1 1 1) simpleGrading (1 1 1)
    hex (25 169 173 29 42 186 170 26) (1 1 1) simpleGrading (1 1 1)
    hex (28 172 158 14 43 187 171 27) (1 1 1) simpleGrading (1 1 1)
    hex (30 174 189 45 25 169 173 29) (1 1 1) simpleGrading (1 1 1)
    hex (47 191 187 43 31 175 171 27) (1 1 1) simpleGrading (1 1 1)
    hex (45 189 192 48 29 173 176 32) (1 1 1) simpleGrading (1 1 1)
    hex (48 192 191 47 32 176 175 31) (1 1 1) simpleGrading (1 1 1)
    hex (54 198 183 39 38 182 167 23) (1 1 1) simpleGrading (1 1 1)
    hex (56 200 202 58 54 198 183 39) (1 1 1) simpleGrading (1 1 1)
    hex (39 183 203 59 23 167 184 40) (1 1 1) simpleGrading (1 1 1)
    hex (35 179 185 41 52 196 204 60) (1 1 1) simpleGrading (1 1 1)
    hex (25 169 186 42 41 185 205 61) (1 1 1) simpleGrading (1 1 1)
    hex (57 201 219 75 56 200 202 58) (1 1 1) simpleGrading (1 1 1)
    hex (58 202 220 76 39 183 203 59) (1 1 1) simpleGrading (1 1 1)
    hex (52 196 204 60 69 213 221 77) (1 1 1) simpleGrading (1 1 1)
    hex (41 185 205 61 60 204 222 78) (1 1 1) simpleGrading (1 1 1)
    hex (74 218 233 89 57 201 219 75) (1 1 1) simpleGrading (1 1 1)
    hex (75 219 234 90 58 202 220 76) (1 1 1) simpleGrading (1 1 1)
    hex (69 213 221 77 84 228 235 91) (1 1 1) simpleGrading (1 1 1)
    hex (60 204 222 78 77 221 236 92) (1 1 1) simpleGrading (1 1 1)
    hex (74 218 232 88 89 233 245 101) (1 1 1) simpleGrading (1 1 1)
    hex (89 233 246 102 75 219 234 90) (1 1 1) simpleGrading (1 1 1)
    hex (97 241 228 84 103 247 235 91) (1 1 1) simpleGrading (1 1 1)
    hex (77 221 236 92 91 235 248 104) (1 1 1) simpleGrading (1 1 1)
    hex (88 232 244 100 101 245 256 112) (1 1 1) simpleGrading (1 1 1)
    hex (89 233 245 101 102 246 257 113) (1 1 1) simpleGrading (1 1 1)
    hex (108 252 241 97 115 259 247 103) (1 1 1) simpleGrading (1 1 1)
    hex (103 247 235 91 116 260 248 104) (1 1 1) simpleGrading (1 1 1)
    hex (100 244 255 111 112 256 265 121) (1 1 1) simpleGrading (1 1 1)
    hex (101 245 256 112 113 257 266 122) (1 1 1) simpleGrading (1 1 1)
    hex (114 258 252 108 125 269 259 115) (1 1 1) simpleGrading (1 1 1)
    hex (115 259 247 103 126 270 260 116) (1 1 1) simpleGrading (1 1 1)
    hex (111 255 264 120 121 265 274 130) (1 1 1) simpleGrading (1 1 1)
    hex (112 256 265 121 122 266 275 131) (1 1 1) simpleGrading (1 1 1)
    hex (124 268 258 114 133 277 269 125) (1 1 1) simpleGrading (1 1 1)
    hex (125 269 259 115 134 278 270 126) (1 1 1) simpleGrading (1 1 1)
    hex (129 273 280 136 120 264 274 130) (1 1 1) simpleGrading (1 1 1)
    hex (121 265 274 130 131 275 281 137) (1 1 1) simpleGrading (1 1 1)
    hex (124 268 277 133 132 276 282 138) (1 1 1) simpleGrading (1 1 1)
    hex (133 277 269 125 139 283 278 134) (1 1 1) simpleGrading (1 1 1)
    hex (135 279 284 140 129 273 280 136) (1 1 1) simpleGrading (1 1 1)
    hex (132 276 282 138 135 279 284 140) (1 1 1) simpleGrading (1 1 1)
    hex (136 280 285 141 130 274 281 137) (1 1 1) simpleGrading (1 1 1)
    hex (133 277 283 139 138 282 286 142) (1 1 1) simpleGrading (1 1 1)
    hex (140 284 287 143 136 280 285 141) (1 1 1) simpleGrading (1 1 1)
    hex (138 282 286 142 140 284 287 143) (1 1 1) simpleGrading (1 1 1)
    hex (17 161 151 7 9 153 153 9) (1 1 1) simpleGrading (1 1 1)
    hex (17 161 162 18 7 151 151 7) (1 1 1) simpleGrading (1 1 1)
    hex (19 163 161 17 9 153 153 9) (1 1 1) simpleGrading (1 1 1)
    hex (9 153 164 20 19 163 163 19) (1 1 1) simpleGrading (1 1 1)
    hex (18 162 177 33 21 165 165 21) (1 1 1) simpleGrading (1 1 1)
    hex (17 161 177 33 18 162 162 18) (1 1 1) simpleGrading (1 1 1)
    hex (17 161 163 19 33 177 177 33) (1 1 1) simpleGrading (1 1 1)
    hex (20 164 172 28 34 178 178 34) (1 1 1) simpleGrading (1 1 1)
    hex (34 178 163 19 20 164 164 20) (1 1 1) simpleGrading (1 1 1)
    hex (19 163 178 34 33 177 177 33) (1 1 1) simpleGrading (1 1 1)
    hex (36 180 165 21 33 177 177 33) (1 1 1) simpleGrading (1 1 1)
    hex (36 180 181 37 21 165 165 21) (1 1 1) simpleGrading (1 1 1)
    hex (28 172 188 44 34 178 178 34) (1 1 1) simpleGrading (1 1 1)
    hex (44 188 172 28 43 187 187 43) (1 1 1) simpleGrading (1 1 1)
    hex (46 190 189 45 30 174 174 30) (1 1 1) simpleGrading (1 1 1)
    hex (46 190 174 30 35 179 179 35) (1 1 1) simpleGrading (1 1 1)
    hex (36 180 177 33 49 193 193 49) (1 1 1) simpleGrading (1 1 1)
    hex (33 177 178 34 49 193 193 49) (1 1 1) simpleGrading (1 1 1)
    hex (50 194 178 34 44 188 188 44) (1 1 1) simpleGrading (1 1 1)
    hex (34 178 194 50 49 193 193 49) (1 1 1) simpleGrading (1 1 1)
    hex (51 195 190 46 35 179 179 35) (1 1 1) simpleGrading (1 1 1)
    hex (51 195 179 35 52 196 196 52) (1 1 1) simpleGrading (1 1 1)
    hex (53 197 182 38 37 181 181 37) (1 1 1) simpleGrading (1 1 1)
    hex (37 181 180 36 53 197 197 53) (1 1 1) simpleGrading (1 1 1)
    hex (36 180 193 49 53 197 197 53) (1 1 1) simpleGrading (1 1 1)
    hex (55 199 198 54 38 182 182 38) (1 1 1) simpleGrading (1 1 1)
    hex (38 182 197 53 55 199 199 55) (1 1 1) simpleGrading (1 1 1)
    hex (62 206 197 53 49 193 193 49) (1 1 1) simpleGrading (1 1 1)
    hex (63 207 187 43 47 191 191 47) (1 1 1) simpleGrading (1 1 1)
    hex (43 187 207 63 44 188 188 44) (1 1 1) simpleGrading (1 1 1)
    hex (44 188 207 63 50 194 194 50) (1 1 1) simpleGrading (1 1 1)
    hex (45 189 208 64 48 192 192 48) (1 1 1) simpleGrading (1 1 1)
    hex (46 190 208 64 45 189 189 45) (1 1 1) simpleGrading (1 1 1)
    hex (46 190 195 51 64 208 208 64) (1 1 1) simpleGrading (1 1 1)
    hex (65 209 191 47 48 192 192 48) (1 1 1) simpleGrading (1 1 1)
    hex (47 191 209 65 63 207 207 63) (1 1 1) simpleGrading (1 1 1)
    hex (65 209 192 48 64 208 208 64) (1 1 1) simpleGrading (1 1 1)
    hex (62 206 193 49 66 210 210 66) (1 1 1) simpleGrading (1 1 1)
    hex (66 210 193 49 50 194 194 50) (1 1 1) simpleGrading (1 1 1)
    hex (67 211 194 50 63 207 207 63) (1 1 1) simpleGrading (1 1 1)
    hex (50 194 211 67 66 210 210 66) (1 1 1) simpleGrading (1 1 1)
    hex (51 195 212 68 64 208 208 64) (1 1 1) simpleGrading (1 1 1)
    hex (68 212 195 51 52 196 196 52) (1 1 1) simpleGrading (1 1 1)
    hex (52 196 213 69 68 212 212 68) (1 1 1) simpleGrading (1 1 1)
    hex (55 199 197 53 70 214 214 70) (1 1 1) simpleGrading (1 1 1)
    hex (62 206 214 70 53 197 197 53) (1 1 1) simpleGrading (1 1 1)
    hex (56 200 198 54 71 215 215 71) (1 1 1) simpleGrading (1 1 1)
    hex (54 198 199 55 71 215 215 71) (1 1 1) simpleGrading (1 1 1)
    hex (55 199 214 70 71 215 215 71) (1 1 1) simpleGrading (1 1 1)
    hex (72 216 201 57 56 200 200 56) (1 1 1) simpleGrading (1 1 1)
    hex (56 200 215 71 72 216 216 72) (1 1 1) simpleGrading (1 1 1)
    hex (72 216 217 73 57 201 201 57) (1 1 1) simpleGrading (1 1 1)
    hex (73 217 218 74 57 201 201 57) (1 1 1) simpleGrading (1 1 1)
    hex (62 206 223 79 70 214 214 70) (1 1 1) simpleGrading (1 1 1)
    hex (62 206 210 66 79 223 223 79) (1 1 1) simpleGrading (1 1 1)
    hex (65 209 224 80 63 207 207 63) (1 1 1) simpleGrading (1 1 1)
    hex (65 209 208 64 80 224 224 80) (1 1 1) simpleGrading (1 1 1)
    hex (63 207 224 80 67 211 211 67) (1 1 1) simpleGrading (1 1 1)
    hex (64 208 212 68 80 224 224 80) (1 1 1) simpleGrading (1 1 1)
    hex (67 211 224 80 81 225 225 81) (1 1 1) simpleGrading (1 1 1)
    hex (67 211 225 81 66 210 210 66) (1 1 1) simpleGrading (1 1 1)
    hex (66 210 225 81 79 223 223 79) (1 1 1) simpleGrading (1 1 1)
    hex (69 213 226 82 68 212 212 68) (1 1 1) simpleGrading (1 1 1)
    hex (68 212 227 83 80 224 224 80) (1 1 1) simpleGrading (1 1 1)
    hex (83 227 212 68 82 226 226 82) (1 1 1) simpleGrading (1 1 1)
    hex (82 226 213 69 84 228 228 84) (1 1 1) simpleGrading (1 1 1)
    hex (85 229 214 70 79 223 223 79) (1 1 1) simpleGrading (1 1 1)
    hex (71 215 214 70 86 230 230 86) (1 1 1) simpleGrading (1 1 1)
    hex (85 229 230 86 70 214 214 70) (1 1 1) simpleGrading (1 1 1)
    hex (73 217 216 72 87 231 231 87) (1 1 1) simpleGrading (1 1 1)
    hex (72 216 215 71 87 231 231 87) (1 1 1) simpleGrading (1 1 1)
    hex (86 230 231 87 71 215 215 71) (1 1 1) simpleGrading (1 1 1)
    hex (73 217 232 88 74 218 218 74) (1 1 1) simpleGrading (1 1 1)
    hex (73 217 231 87 88 232 232 88) (1 1 1) simpleGrading (1 1 1)
    hex (85 229 223 79 93 237 237 93) (1 1 1) simpleGrading (1 1 1)
    hex (93 237 223 79 81 225 225 81) (1 1 1) simpleGrading (1 1 1)
    hex (83 227 238 94 80 224 224 80) (1 1 1) simpleGrading (1 1 1)
    hex (94 238 225 81 80 224 224 80) (1 1 1) simpleGrading (1 1 1)
    hex (95 239 225 81 94 238 238 94) (1 1 1) simpleGrading (1 1 1)
    hex (95 239 237 93 81 225 225 81) (1 1 1) simpleGrading (1 1 1)
    hex (82 226 240 96 83 227 227 83) (1 1 1) simpleGrading (1 1 1)
    hex (83 227 240 96 94 238 238 94) (1 1 1) simpleGrading (1 1 1)
    hex (84 228 240 96 82 226 226 82) (1 1 1) simpleGrading (1 1 1)
    hex (96 240 228 84 97 241 241 97) (1 1 1) simpleGrading (1 1 1)
    hex (85 229 242 98 86 230 230 86) (1 1 1) simpleGrading (1 1 1)
    hex (85 229 237 93 98 242 242 98) (1 1 1) simpleGrading (1 1 1)
    hex (99 243 231 87 86 230 230 86) (1 1 1) simpleGrading (1 1 1)
    hex (98 242 243 99 86 230 230 86) (1 1 1) simpleGrading (1 1 1)
    hex (88 232 231 87 100 244 244 100) (1 1 1) simpleGrading (1 1 1)
    hex (100 244 231 87 99 243 243 99) (1 1 1) simpleGrading (1 1 1)
    hex (105 249 237 93 95 239 239 95) (1 1 1) simpleGrading (1 1 1)
    hex (106 250 242 98 93 237 237 93) (1 1 1) simpleGrading (1 1 1)
    hex (106 250 237 93 105 249 249 105) (1 1 1) simpleGrading (1 1 1)
    hex (96 240 251 107 94 238 238 94) (1 1 1) simpleGrading (1 1 1)
    hex (95 239 238 94 107 251 251 107) (1 1 1) simpleGrading (1 1 1)
    hex (95 239 251 107 105 249 249 105) (1 1 1) simpleGrading (1 1 1)
    hex (109 253 251 107 96 240 240 96) (1 1 1) simpleGrading (1 1 1)
    hex (97 241 253 109 96 240 240 96) (1 1 1) simpleGrading (1 1 1)
    hex (109 253 241 97 108 252 252 108) (1 1 1) simpleGrading (1 1 1)
    hex (98 242 254 110 99 243 243 99) (1 1 1) simpleGrading (1 1 1)
    hex (98 242 250 106 110 254 254 110) (1 1 1) simpleGrading (1 1 1)
    hex (99 243 255 111 100 244 244 100) (1 1 1) simpleGrading (1 1 1)
    hex (111 255 243 99 110 254 254 110) (1 1 1) simpleGrading (1 1 1)
    hex (106 250 261 117 110 254 254 110) (1 1 1) simpleGrading (1 1 1)
    hex (105 249 261 117 106 250 250 106) (1 1 1) simpleGrading (1 1 1)
    hex (105 249 251 107 117 261 261 117) (1 1 1) simpleGrading (1 1 1)
    hex (109 253 262 118 107 251 251 107) (1 1 1) simpleGrading (1 1 1)
    hex (107 251 262 118 117 261 261 117) (1 1 1) simpleGrading (1 1 1)
    hex (108 252 262 118 109 253 253 109) (1 1 1) simpleGrading (1 1 1)
    hex (114 258 262 118 108 252 252 108) (1 1 1) simpleGrading (1 1 1)
    hex (119 263 254 110 117 261 261 117) (1 1 1) simpleGrading (1 1 1)
    hex (110 254 264 120 111 255 255 111) (1 1 1) simpleGrading (1 1 1)
    hex (120 264 254 110 119 263 263 119) (1 1 1) simpleGrading (1 1 1)
    hex (123 267 262 118 114 258 258 114) (1 1 1) simpleGrading (1 1 1)
    hex (123 267 258 114 124 268 268 124) (1 1 1) simpleGrading (1 1 1)
    hex (117 261 271 127 119 263 263 119) (1 1 1) simpleGrading (1 1 1)
    hex (127 271 261 117 118 262 262 118) (1 1 1) simpleGrading (1 1 1)
    hex (128 272 271 127 118 262 262 118) (1 1 1) simpleGrading (1 1 1)
    hex (123 267 272 128 118 262 262 118) (1 1 1) simpleGrading (1 1 1)
    hex (119 263 273 129 120 264 264 120) (1 1 1) simpleGrading (1 1 1)
    hex (129 273 263 119 127 271 271 127) (1 1 1) simpleGrading (1 1 1)
    hex (132 276 272 128 123 267 267 123) (1 1 1) simpleGrading (1 1 1)
    hex (123 267 268 124 132 276 276 132) (1 1 1) simpleGrading (1 1 1)
    hex (135 279 273 129 127 271 271 127) (1 1 1) simpleGrading (1 1 1)
    hex (127 271 272 128 135 279 279 135) (1 1 1) simpleGrading (1 1 1)
    hex (128 272 276 132 135 279 279 135) (1 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (246 257 113 102)
            (257 266 122 113)
            (266 275 131 122)
            (275 281 137 131)
            (281 285 141 137)
            (286 283 139 142)
            (285 287 143 141)
            (287 286 142 143)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (145 149 5 1)
            (149 156 12 5)
            (156 168 24 12)
            (168 184 40 24)
            (184 203 59 40)
            (203 220 76 59)
            (220 234 90 76)
            (234 246 102 90)
            (205 186 42 61)
            (222 205 61 78)
            (236 222 78 92)
            (248 236 92 104)
            (260 248 104 116)
            (270 260 116 126)
            (278 270 126 134)
            (283 278 134 139)
            (144 145 1 0)
            (148 144 0 4)
            (150 148 4 6)
            (157 150 6 13)
            (159 157 13 15)
            (160 159 15 16)
            (170 160 16 26)
            (186 170 26 42)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (1 2 3 0)
            (146 145 144 147)
            (8 2 1 5)
            (146 152 149 145)
            (2 7 9 3)
            (151 146 147 153)
            (0 3 10 4)
            (147 144 148 154)
            (11 8 5 12)
            (152 155 156 149)
            (4 10 14 6)
            (154 148 150 158)
            (18 7 2 8)
            (151 162 152 146)
            (3 9 20 10)
            (153 147 154 164)
            (21 18 8 11)
            (162 165 155 152)
            (22 11 12 24)
            (155 166 168 156)
            (6 14 27 13)
            (158 150 157 171)
            (10 20 28 14)
            (164 154 158 172)
            (27 31 15 13)
            (175 171 157 159)
            (32 29 26 16)
            (173 176 160 170)
            (31 32 16 15)
            (176 175 159 160)
            (37 21 11 22)
            (165 181 166 155)
            (38 37 22 23)
            (181 182 167 166)
            (23 22 24 40)
            (166 167 184 168)
            (25 30 35 41)
            (174 169 185 179)
            (29 25 42 26)
            (169 173 170 186)
            (14 28 43 27)
            (172 158 171 187)
            (45 30 25 29)
            (174 189 173 169)
            (43 47 31 27)
            (191 187 171 175)
            (48 45 29 32)
            (189 192 176 173)
            (47 48 32 31)
            (192 191 175 176)
            (39 54 38 23)
            (198 183 167 182)
            (58 56 54 39)
            (200 202 183 198)
            (59 39 23 40)
            (183 203 184 167)
            (41 35 52 60)
            (179 185 204 196)
            (42 25 41 61)
            (169 186 205 185)
            (75 57 56 58)
            (201 219 202 200)
            (76 58 39 59)
            (202 220 203 183)
            (60 52 69 77)
            (196 204 221 213)
            (61 41 60 78)
            (185 205 222 204)
            (89 74 57 75)
            (218 233 219 201)
            (90 75 58 76)
            (219 234 220 202)
            (77 69 84 91)
            (213 221 235 228)
            (78 60 77 92)
            (204 222 236 221)
            (88 74 89 101)
            (218 232 245 233)
            (102 89 75 90)
            (233 246 234 219)
            (84 97 103 91)
            (241 228 235 247)
            (92 77 91 104)
            (221 236 248 235)
            (100 88 101 112)
            (232 244 256 245)
            (101 89 102 113)
            (233 245 257 246)
            (97 108 115 103)
            (252 241 247 259)
            (91 103 116 104)
            (247 235 248 260)
            (111 100 112 121)
            (244 255 265 256)
            (112 101 113 122)
            (245 256 266 257)
            (108 114 125 115)
            (258 252 259 269)
            (103 115 126 116)
...
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
